Revit 2027 API
StairsType.MinTreadDepth Property
 The minimum tread width along the center path for all common runs (winder, arc, and straight).
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MinTreadDepth { get; set; }
Public Property MinTreadDepth As Double
	Get
	Set
public:
property double MinTreadDepth {
	double get ();
	void set (double value);
}
member MinTreadDepth : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for minTreadDepth must be greater than 0 and no more than 30000 feet.
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace